simpleapi/app/controllers/api/v1/services_controller.rb

SELECT "services".* FROM "services"
---
    def index
        @services = Service.all

SELECT  "services".* FROM "services" WHERE "services"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def show
        @services = Service.find(params[:id])

INSERT INTO "services" ("payload", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["payload", "210-98-7333"], ["body", "Never Trust a big butt and a smile"], ["created_at", "2020-08-05 21:08:42.577780"], ["updated_at", "2020-08-05 21:08:42.577780"]]
---
    def create
        @services = Service.new(service_params)
        if @services.save