simple_payload/app/controllers/payloads_controller.rb

SELECT "payloads".* FROM "payloads"
---
  def index
    @payloads = Payload.all

INSERT INTO "payloads" ("message", "created_at", "updated_at") VALUES (?, ?, ?)  [["message", "What chu talkin about willis"], ["created_at", "2020-08-06 17:49:06.105319"], ["updated_at", "2020-08-06 17:49:06.105319"]]
---
  def create
    @payload = Payload.new(payload_params)

    if @payload.save